[
  {
    "title": "Travel",
    "alias": "yyz",
    "headline": "Flying Solo for the first time for a conference",
    "timeline": "Jun 16 2024",
    "searchDescription": "I fly to Toronto for the first time for the collision conference",
    "longDescription": "My birthday happened to fall on the same day as the Collision Conference in Toronto. Naturally, I did what any normal person would—I wrote my parents a long essay about why I had to spend my 18th birthday (my favorite number, by the way) surrounded by leading tech players and emerging startups. Luckily, they agreed.\n\nIt was my first time flying solo, and the entire experience was nothing short of incredible. Exploring the city on my own, meeting online friends in person for the first time, and soaking up Toronto’s vibrant energy—these are moments I find myself reminiscing about all the time.\n\nOne of the highlights of my trip was being invited onto the GoodLawyers yacht, where I tried caviar for the first time (a unique experience, to say the least). Onboard, I connected with amazing people from sectors ranging from Tech to Law, all united by a shared passion for transforming the way people live and work.\n\nThe spontaneous city adventures, the incredible conversations, and the people who made the trip so special left a lasting impact on me. It’s only made me more excited to travel, meet new people, and keep expanding my horizons."
  },
  {
    "title": "Event",
    "alias": "speech",
    "headline": "Giving my first speech",
    "timeline": "Jun 20 2024",
    "searchDescription": "I represent the future of technolgy in a fireside chat in industry leaders at Platform Calgay's Annual Meeting",
    "longDescription": "I used to be terrified of public speaking. My number one goal for 2024 was to obliterate this fear and start publicizing my brand. I’ve learned that the best way to get over a fear of public speaking is just to do it—practice. Before I started, this advice didn’t resonate with me at all because I was searching for easier ways to get over the hurdle. But sometimes, the best path is the one that tests your comfort and boundaries the most.\n\nThroughout the year, as I was applying for scholarships and universities, I realized something important: when I wrote my essays, I was reading and writing them like speeches—ones that just didn’t have a formal audience. By writing the way I speak, I became more comfortable with my own voice. I learned that I could replace fear with the excitement of the opportunity ahead of me. Instead of fixating on what could happen while I’m speaking, I started focusing on what comes after: pride, relief, and exposure.\n\nThis mindset shift led to an amazing opportunity: I got to speak at Platform Calgary’s Annual Partners event as a 10x Future Founder Scholarship recipient. It was the result of months of working to put my name out there in the ecosystem. The entire experience was thrilling. Although I was definitely nervous at first, I became more comfortable as I spoke because the story I was sharing was the very one that brought me to that stage.\n\nI can’t wait to keep jumping off more (imaginary) cliffs and testing the limits of my comfort zone. I hope to speak at even more conferences in 2025—maybe even some across the globe. I’ve grown to love public speaking because it’s another medium for me to inspire people—through storytelling."
  },
  {
    "title": "Presentation",
    "alias": "rbc",
    "headline": "Sharing my journey with RBCX",
    "timeline": "Sept 26 2024",
    "searchDescription": "I got invited to share my journey in technology with the CPO, Vice President of Ventures Technology, and executives at RBCX",
    "longDescription": "I was honored to be the recipient of the 2023-2024 Hackergal x RBCx Innovation Scholarship. As part of this award, I had the incredible opportunity to share my story with the Chief Product Officer, Vice President of Ventures Technology, and other executives at RBC. I’m deeply grateful for the conversations and advice I received about becoming a leader in the technology space—wisdom that I’ve been actively channeling into how I approach my work today.\n\nI was also fortunate to attend a dinner hosted by RBCx, where I was surrounded by inspiring female leaders. Listening to their career journeys and how they’ve become activators of change in their respective fields was both refreshing and empowering. To say I was inspired would be an understatement."
  },
  {
    "title": "Travel",
    "alias": "spont",
    "headline": "Spontaneously flying to Toronto for a Hackathon because I was bored",
    "timeline": "Nov 22 2024",
    "type": "startup",
    "searchDescription": "Catching flights will never not be fun. I get to a be a girl in a fun city.",
    "longDescription": "After earning placements at both the Cohere x OpenSesame Hackathon and Meta Llama Hacks during a specific weekend in November 2024, I impulsively booked a last-minute flight to Toronto (again) for a whirlwind 72-hour stay. I must admit, programming in Toronto feels uniquely exciting. While the rest of the world was enjoying the Eras Tour, I was soaking up the energy of builders and the vibrant city I had missed :)"
  }
]
