[
  {
    "title": "Creative",
    "alias": "tiktok",
    "headline": "Becoming a TikTok Editor",
    "timeline": "Sept 20 2022",
    "image": "https://i.pinimg.com/1200x/0c/72/c7/0c72c7b750b438d4165217a8bc16b9f5.jpg",
    "searchDescription": "Reflecting on how I overcame my fears to become a successful TikTok editor with thousands of followers.",
    "longDescription": "I used to be terrified of sharing my creative side online. My number one goal in 2022 was to overcome this fear and start showcasing my skills to the world. At the time, putting my edits and creative projects on a platform as vast as TikTok felt daunting. What if people didn’t like them? What if no one even saw my edits? These questions consumed me. But I eventually realized that the only way to conquer this fear was to face it head-on—by posting. At first, this advice felt impossible to follow. I kept searching for “easier” ways to build my confidence and get over the hurdle. Nothing worked until I took that leap and shared my first edit. To my surprise, the feedback was overwhelmingly positive. I learned that by embracing my creativity and sharing it authentically, I could not only connect with others but also refine my own abilities. As I kept posting, I discovered a rhythm and started building a community. I experimented with trends, storytelling, and creative techniques, all while staying true to my style. By the end of 2022, I had gained thousands of followers, and my fear had turned into excitement. The more I posted, the more I grew—both as an editor and as a person. Looking back, I realized that my biggest obstacle wasn’t the fear of judgment but the fear of trying. Sharing my work online, good and bad, tested my comfort zone like nothing else, and it taught me to embrace vulnerability as a source of strength. Now, in 2025, I look forward to inspiring others to overcome their fears and embrace their creative sides. Whether through TikTok edits or other mediums, I’ve found a passion for storytelling that I never want to let go of."
  },
  {
    "title": "Travel",
    "alias": "london",
    "headline": "Spontaneously flying to London because I was bored",
    "timeline": "May 22 2024",
    "type": "travel",
    "image": "/search-img/london-banner.png",
    "searchDescription": "Catching flights will never not be fun. I get to a be a girl in a fun city.",
    "tech": ["London", "Life"],
    "longDescription": "After a stressful week of finals in May 2024, I decided to shake things up and impulsively booked a last-minute flight to London. No hackathons, no specific plans—just pure spontaneity. There’s something uniquely thrilling about exploring a new city alone simply because you can. While the rest of the world was obsessing over the Eras Tour, I was wandering through London’s streets, soaking in the charm and indulging in a little adventure to cure my boredom."
  },
  {
    "title": "Teaching",
    "alias": "ta",
    "headline": "Becoming a Teaching Assistant for the First Time",
    "timeline": "Sept 12 2024",
    "image": "/search-img/ta-banner.png",
    "searchDescription": "My first teaching journey as a Computer Science TA, navigating the challenges of imposter syndrome while learning to help others",
    "longDescription": "When I became a Computer Science Teaching Assistant, I stepped into the role with equal parts excitement and self-doubt. I often found myself wondering if I was smart enough or truly qualified to teach such challenging topics to others. Grappling with imposter syndrome, I worried about not having all the answers or if my understanding was deep enough to help my students succeed. But despite those doubts, the experience turned out to be incredibly rewarding. Guiding students through tricky concepts and seeing their “aha” moments was a joy I hadn’t anticipated. Along the way, I not only solidified my own knowledge but also discovered a newfound confidence in my ability to lead and support others. Every interaction became a chance to grow, learn, and inspire—not just for my students, but for myself too. It’s an experience that continues to shape how I approach challenges in the tech world, reminding me that growth often comes from the moments where we feel the least certain."
  }
]