[
  {
    "title": "Blu3Whale ED",
    "type": "project",
    "alias": "blu3whale",
    "headline": "Girl discovers programming (***EMOTIONAL***)",
    "timeline": "Jan 2022 - Mar 2022",
    "searchDescription": "A mobile app that combines community-driven features to help individuals suffering from eating disorders recover · Technovation Girls Semifinalist (Top 8 in Canada) · Python · Kivy · Sentiment Analysis",
    "longDescription": "Blu3Whale ED was the very first project I made two months into my programming journey. I was obsessed with Python at the time, so I spent countless hours trying to find a way to develop a mobile app using a framework the language would support and stumbled upon Kivy. Do I recommend this framework for mobile development? Eh.\n\nThe entire development process was quite clean, and I found the framework supported a breadth of UI customization. I incorporated a real-time public chat, a recipe search engine, and, using inspiration from similar apps on the market, a tracker that would instead track users' moods instead of their calories or other sensitive numbers. I used NLTK for sentiment analysis, a library I’m not sure still exists, but it was a nice intro into sentiment analysis as the framework had a comprehensive lexicon dictionary that attached polarity scores with an accuracy that made my grade-10 self say, “Wow!”\n\nIt took three weeks of 10-hour programming days and intense climbing of an exciting learning curve to create the app, and another whole month to figure out how to deploy the app to the Android store.\n\nProbably the most tedious part of the journey was installing a virtual machine on my laptop and navigating Linux for the first time. I cut it close, but I got the app to work and be downloadable via the Play Store just in time to submit it to the Technovation Girls competition, where I landed a semi-finalist position.",
    "tech": ["Python", "Matplotlib", "Numpy", "NLTK"],
    "links": [{"link": "https://github.com/rumezaa/blu3whale", "name": "github", "url": "github-outline.svg" , "urlHover": "github-outline.svg"}]

  },
  {
    "title": "YYC Tech Connect",
    "type": "project",
    "headline": "Girl discovers programming with other people",
    "alias": "tech-connect",
    "timeline": "Feb 2022 - Jun 2022",
    "searchDescription": "A calendar aggregator made with React and Flask to centralize ongoing events in the YYC tech sector using the Eventbrite API - I'm banned from this API now :(",
    "longDescription": "This was the first collaborative project I participated in and the first time I got to use React. Following my love for Python, I insisted on using Flask for the backend, which I hadn't used before. Back then, I equated everything to 'easy' if it was Python, so how hard could it be?\n\nKeeping in mind I had no knowledge about proxy servers nor understood the concept of ports, when it came time to connect the Flask backend with the React frontend my team created, the experience was... something I'm grateful I got to go through because I figured out everything without ChatGPT—unlike some of you (kidding, I love ChatGPT).\n\nIn short, I had to do something along the lines of hard-coding the build path for the frontend into my Flask application for it to render so it all ran on one port. Or something like that.\n\nHere, I realized Python was maybe not the best for everything.", 
    "tech": ["Flask", "EventBrite", "React.js", "Material UI"],
    "links": [{"link": "https://github.com/rumezaa/mockup", "name": "github", "url": "github-outline.svg" , "urlHover": "github-outline.svg" }]
  },
  {
    "title": "Winter Go",
    "type": "hackathon",
    "alias": "winter-go",
    "headline": "Hackathon team saves Calgary's tourism scene",
    "timeline": "Feb 2023",
    "searchDescription": "A web-app designed to recommend tourists locations and activities based on the weather. Top 3 project for YYCHacks 2023 · TailwindCSS · Express.js · Figma ",
    "longDescription": "My first hackathon project was a (semi) winner how much aura do I gain.", 
    "tech": ["Express.js", "Tailwind CSS", "An API I forgot the name of"],
    "links": [{"link": "https://hack2023.vercel.app/", "name": "check it out", "url": "link-outline.svg" , "urlHover": "link-outline.svg"}]
  },
  {
    "title": "Torpedo",
    "type": "startup",
    "alias": "torpedo",
    "headline": "Highschoolers undergo the startup cannon event ",
    "timeline": "Mar 2023",
    "searchDescription": "Landing page for Torpedo, a mentorship platform aimed at connecting young talent with mentorship and skill activation opportunities · Labs Batch X",
    "longDescription": "Building Torpedo was an insightful journey into the realm of startups, and is really what fortified my interest for creating software that can be as big as the number of people it can impact. This journey pivoted some of my interests into the world of UI/UX and creating pitch decks for promosining project", 
    "links": [{"link": "https://main--spiffy-capybara-00bee2.netlify.app/", "name": "check it out", "url": "link-outline.svg" , "urlHover": "link-outline.svg"}, {"link": "https://github.com/rumezaa/jointorpedo.Inc", "name": "github", "url": "github-outline.svg" , "urlHover": "github-outline.svg"}]
  },
  {
    "title": "Alexa Connect",
    "alias": "alexa-connect",
    "timeline": "Mar 2023",
    "headline": "18 somthing-year-olds pitch to Amazon Alexa (successfully)",
    "type": "consultancy",
    "searchDescription": "An Omegle and house party hybrid app recommendation to Amazon Alexa which matches users based on their shared interests and uses Alexa to guide them through an engaging activity · Consulting",
    "longDescription": "Consulted for Amazon Alexa then got to pitch the recommendaton to executives (this was my first experience as a project manager). ", 
    "links": [{"link": "https://www.figma.com/proto/DEihgj9v451Bmrza6rXFYs/Alexa-Connect-Mockup?node-id=54-232&p=f&t=vEFc2vQpE4MfEfAK-1&scaling=scale-down&content-scaling=fixed&page-id=0%3A1&starting-point-node-id=54%3A232", "name": "check it out", "url": "link-outline.svg" , "urlHover": "link-outline.svg"},{ "link": "https://drive.google.com/file/d/1IGW4HPWXcz-xMoIpjDRW8B4vE3srwIzk/view?usp=sharing", "name": "pitch deck", "url": "link-outline.svg" , "urlHover": "link-outline.svg"}]
  },

  {
    "title": "Bumblebee",
    "alias": "bumblebee",
    "timeline": "May 2023",
    "headline": "Software Engineer trys turning into an Electrical Engineer (impossible edition) ",
    "type": "research",
    "searchDescription": "A self-sustaining battery pack powered by radio waves and solar energy that provides a continuous and reliable stream of electricity · Research · Moonshot Project",
    "longDescription": "A moonshot project refers to an ambitious, exploratory, and groundbreaking initiative with high risk but equally high potential impact. My partner and I were exploring the sustainable energy space when we decided to deep dive into the world of wireless electricity.\n\nBumblee was a pivot from a larger-scale idea of implementing a completely wireless energy grid by utilizing MRC (Magnetic Resonance Coupling) technology and enhancing its efficiency with radio wave energy harvesters. Our thinking sought to solve the issue of vulnerable physical infrastructure affecting access to electricity in remote regions and areas impacted by severe natural disasters.\n\nWe pivoted to the Bumblee battery pack after understanding the associated risks of a completely wireless grid (although we are not far from a future where this exists). Instead, we implemented our previous system—without coupling—on a smaller scale, where energy is supplied through photovoltaic technology and radio wave energy harvesters.", 
    "links": [{"link": "https://rumeza06.wixstudio.com/bumblebee", "name": "check it out", "url": "link-outline.svg" , "urlHover": "link-outline.svg"},{ "link": "https://docs.google.com/presentation/d/1wipk_objn23PDLHS2NRPPsxt2fv0li9wZbaUScqSdtw/edit?usp=sharing", "name": "pitch deck", "url": "link-outline.svg" , "urlHover": "link-outline.svg"}]
  },
  {
    "title": "Renew",
    "alias": "renew",
    "headline": "Girl builds a fashion circularity app to help local non-profits",
    "timeline": "Jan 2023 - Apr 2023",
    "type": "project",
    "tech": ["React Native", "Nativewind", "Firebase"],
    "searchDescription": "A mobile app built to create a pipeline for charities and nonprofits to gain the supplies they need to scale their missions · Technovation Girls Quarterfinalist",
    "longDescription": "I created Renew, a platform that organizes the allocation of excess donations to charities and non-profits. My research in the fashion sustainability space and interviews with niche non-profits revealed that 80% of clothing donations are exported overseas to developing countries, rather than being distributed within our own economy to help scale local charities, non-profits, or aid people in need. I developed a mobile app solution to address this issue by creating a platform that organizes the allocation of excess donations to charities and non-profits. I have partnered with the local non-profit Good-Neighbor, planning to utilize the app to increase their garment supply and reach more people in need.", 
    "links": [{"link": "https://drive.google.com/file/d/1Gax_ufzoxFZFPidcb58AGp1aJl0Kw3uU/view?ths=true", "name": "business plan", "url": "link-outline.svg" , "urlHover": "link-outline.svg"}, {"link": "https://youtu.be/Qiv7s6PP1yE", "name": "video", "url": "video-outline.svg" , "urlHover": "video-outline.svg"}, {"link": "https://github.com/rumezaa/Renew", "name": "github", "url": "github-outline.svg" , "urlHover": "github-outline.svg"}]
  },
  {
    "title": "Nurture",
    "alias": "nurture",
    "headline": "Hackathon team attempts to align generational communication gap",
    "timeline": "Aug 2024",
    "type": "project",
    "tech": ["Flask"," React.js", "OpenAI API"],
    "searchDescription": "A web app designed to bring the functional family therapy online and bridge generational communication gaps · Albert Health Hacks", 
    "longDescription": "Inspired by generational communication between parents and children, we created a tool that allows real-time monitoring of your communication with family members, partners, or friends. The tool helps assess how they'll receive your message and suggests the best way to communicate based on their attitudes. The Nurture app is designed to help your family or group stay connected with your Functional Family Therapy process, providing access to your therapist and therapy notes to promote transparency in the therapy journey. This app was developed for Albert Health Hacks.",
    "links": [{"link": "https://www.youtube.com/watch?v=V7ieDzRjtcY&t=9s", "name": "video", "url": "video-outline.svg" , "urlHover": "video-outline.svg"}, {"link": "https://github.com/rumezaa/nurture", "name": "github", "url": "github-outline.svg" , "urlHover": "github-outline.svg"}]
  },
  {
    "title": "Muto",
    "alias": "muto",
    "headline": "University sweats build a workforce reintegration tool under 24 hours",
    "timeline": "Nov 2024",
    "type": "project",
    "tech": ["Next.js","Firebase", "Tailwind"],
    "searchDescription": "A Next.js app aimed at providing the vulnerable population with the resources and opportunities they need to reintegrate into society · Hack the Change 2024",
    "longDescription": "Our platform onboard vulnerable individuals by listening to their stories and struggles. We use a custom TensorFlow model with 75 input nodes and dual 16-node hidden layers to analyze keyword frequency and emotions in user narratives. This allows us to generate tailored resource, job, and mentor suggestions based on users' experiences and skills. Developed in under 24 hours for Hack the Change 2024, we also engaged with our target demographic (the homeless) to gather feedback on our product.", 
    "links": [{"link": "https://github.com/rumezaa/Hackthechange", "name": "github", "url": "github-outline.svg" , "urlHover": "github-outline.svg"}, {"link": "https://hackthechange-lime.vercel.app/", "name": "check it out", "url": "link-outline.svg" , "urlHover": "link-outline.svg"}]
  },
  {
    "title": "Dogma AI",
    "alias": "dogma",
    "headline": "Girl flys to Toronto because she heard Cohere, OpenSesame and Hackathon in the same sentence",
    "timeline": "Nov 2024",
    "type": "project",
    "tech": ["Next.js", "Tailwind", "Tavus API"],
    "searchDescription": "An AI tutor you can join a call with to explain topics ranging from complicated school problems to real life advice · (not responsible for anything bad AI says <3)",
    "longDescription": "I was one of the 32 people selected to participate in the Hunger Games-style Cohere x Open Sesame Hackathon in Toronto. I flew out for the sole purpose of attending because hackathons make me feel things. We created an AI tutor using the Tavus API that you can join a call with. Simply upload a document ranging from complicated math problems to 2025 mood boards and have a real-time conversation with our assistant. How goated is this.", 
    "links": [{"link": "https://github.com/rumezaa/cohere-opensesame", "name": "github", "url": "github-outline.svg" , "urlHover": "github-outline.svg"}, {"link": "https://drive.google.com/file/d/1YPrVSsCgJ8JRlvLQXzU20SsFIBdKSkDx/view", "name": "team", "url": "link-outline.svg" , "urlHover": "link-outline.svg"}]
  },
  {
    "title": "Meetmidway",
    "alias": "meetmidway",
    "headline": "Pre-successul CS sweats compress a 2-month hackathon project into 2 weeks of grind",
    "timeline": "present",
    "type": "startup",
    "searchDescription": "We bring your plans outside of the groupchat",
    "longDescription": "Started in the google GEMINI hackathon. Comming to a phone near you", 
    "links": [{"link": "https://www.instagram.com/reel/DAhFIbZSyEG/", "name": "video", "url": "video-outline.svg" , "urlHover": "video-outline.svg"}]
  }

]

